[
    {
        "title": "Software Engineer III",
        "companyName": "Biomeme",
        "startDate": "May 2021",
        "endDate": "Current",
        "image": {
            "path": "/src/assets/images/biomeme_inc_logo.jpg",
            "altText": "Company Logo for Biomeme Inc"
        },
        "bulletPoints": [
            "Led development of the backend API, database, and cloud infrastructure for an intuitive online interface enabling employers to schedule medically diagnostic tests for their employees, increasing the overall efficiency for labs and employers.",
            "Managed a variety of AWS services, including Lambda, ECS, API Gateway, RDS, IAM, Cognito, CloudWatch, CloudFormation, and S3, to build secure, scalable, and highly available cloud-based solutions for several of our projects.",
            "Converted a legacy desktop python app into a modern electron app complete with vite, react, and electron forge to reduce technical debt and increase TTD for product enhancements.",
            "Contributed to the development of several React Native (Android) applications responsible for communicating via bluetooth with our custom thermocycling hardware.",
            "Improved the user interface and experience of several products based on user interaction and general best practices in UI/UX development",
            "Created comprehensive Figma diagrams and mockups, shaping the implementation of new features and User Experience.",
            "Automated build and deployment processes using CircleCI, reducing time to deployment and enhancing overall efficiency.",
            "Prioritized feature requests and addressed issues by leveraging data from tools like Sentry, CloudWatch, and Snyk.",
            "Utilized Jira to manage project tasks, stories, and sprints, ensuring team alignment and effective progress tracking.",
            "Provided mentorship, guidance, and knowledge to junior team members, contributing to their professional development.",
            "Earned a promotion to Seniority Level III by consistently surpassing role expectations, as recognized by management."
        ]
    },
    {
        "title": "Software Engineer",
        "companyName": "Gnostech",
        "startDate": "Sept 2016",
        "endDate": "May 2021",
        "image": {
            "path": "/src/assets/images/Fy1hsLPD_400x400.jpg",
            "altText": "Company Logo for Gnostech Inc"
        },
        "bulletPoints": [
            "Full stack development on several applications leveraging Java 11, Spring Boot, MySQL, C#, WPF, Angular, and Typescript",
            "Led the design, development, and deployment of a microservice oriented architecture built upon DevOps principles utilizing AWS, Docker, Kubernetes, Terraform (Infrastructure as code), Gitlab CI/CD, and Spring Boot Cloud.",
            "Created a developer toolkit that significantly increased productivity, resulting in faster development time.",
            "Major Contributor and developer to the cloud-based patch management solution deployed and used by the US Navy.",
            "Elected member of the User Interface review board to provide feedback and guidance on UI changes",
            "Spearheaded the design and development of a help desk management system with video streaming capabilities.",
            "Identified and delivered a critical enhancement to the application, greatly improving security and stability.",
            "Interviewed and evaluated candidates for the software development team and mentored other members of the team.",
            "Maintained a DoD Secret Security Clearance and CompTIA Security+ Certification"
        ]
    }
]